app/controllers/profiles_controller.rb

  def analysis
    log_id = decoder(params[:log_id])
    @confidence = decoder(params[:confidence])
    @log = Log.find_by_id(log_id)
---
SELECT  "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 201799169], ["LIMIT", 1]]

  def delete
    Log.find_by_id(params[:id].to_i)&.destroy
---
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 201799169]]
SELECT  "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 201799169], ["LIMIT", 1]]

  def print
    @log = Log.find_by_id(params[:id].to_i)
---
SELECT  "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def save
    Log.find_by_id(params[:id].to_i)&.update_attributes!(status: 1)
---
SELECT  "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 201799169], ["LIMIT", 1]]
UPDATE "logs" SET "status" = ?, "updated_at" = ? WHERE "logs"."id" = ?  [["status", 1], ["updated_at", "2018-01-17 17:19:29.984727"], ["id", 201799169]]

  def index
    Log.where(status: 0).destroy_all
---
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 201799169]]
SELECT "logs".* FROM "logs" WHERE "logs"."status" = ?  [["status", 0]]